In [1]:
from pyspark.sql import SparkSession
import pandas as pd

spark = SparkSession.builder.getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/05/31 09:56:05 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable
23/05/31 09:56:06 WARN Utils: Service 'SparkUI' could not bind on port 4040. Attempting port 4041.

In [2]:
titanic_sdf = spark.read.csv('data/titanic_train.csv', header=True, inferSchema=True)
print('titanic sdf type:', type(titanic_sdf))
titanic_sdf.show()

titanic sdf type: <class 'pyspark.sql.dataframe.DataFrame'>
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
|         11|       1|     3|Sandstrom, Miss. ...|female| 4.0|    1|    1|         PP 9549|   16.7|   G6|       S|
|         12|       1|     1|Bonnell, Miss. El...|female|58.0|    0|    0|          113783|  26.55| C103|       S|
|         13|       0|     3|Saundercock, Mr. ...|  male|20.0|    0|    0|       A/5. 2151|   8.05| null|       S|
|         14|       0|     3|Andersson, Mr. An...|  male|39.0|    1|    5|          347082| 31.275| null|       S|
|         15|       0|     3|Vestrom, Miss. Hu...|female|14.0|    0|    0|          350406| 7.8542| null|       S|
|         16|       1|     2|Hewlett, Mrs. (Ma...|female|55.0|    0|    0|          248706|   16.0| null|       S|
|         17|       0|     3|Rice, Master. Eugene|  male| 2.0|    4|    1|          382652| 29.125| null|       Q|
|         18|       1|     2|Williams, Mr. Cha...|  male|null|    0|    0|          244373|   13.0| null|       S|
|         19|       0|     3|Vander Planke, Mr...|female|31.0|    1|    0|          345763|   18.0| null|       S|
|         20|       1|     3|Masselmani, Mrs. ...|female|null|    0|    0|            2649|  7.225| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
only showing top 20 rows

In [3]:
pandas_df = pd.read_csv('data/titanic_train.csv', header='infer')
pandas_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
titanic_pdf = titanic_sdf.toPandas()
print(type(titanic_pdf))

titanic_pdf

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,None,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"""Johnston, Miss. Catherine Helen """"Carrie""""""",female,NaN,1,2,W./C. 6607,23.4500,None,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,None,Q

In [5]:
titanic_sdf = titanic_sdf.cache()

In [6]:
print(type(titanic_pdf.head(10)))
titanic_pdf.head(10)

<class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,None,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,None,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,None,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,None,C

In [7]:
print(type(titanic_sdf.head(10)))
titanic_sdf.head(10)

<class 'list'>

[Row(PassengerId=1, Survived=0, Pclass=3, Name='Braund, Mr. Owen Harris', Sex='male', Age=22.0, SibSp=1, Parch=0, Ticket='A/5 21171', Fare=7.25, Cabin=None, Embarked='S'),
 Row(PassengerId=2, Survived=1, Pclass=1, Name='Cumings, Mrs. John Bradley (Florence Briggs Thayer)', Sex='female', Age=38.0, SibSp=1, Parch=0, Ticket='PC 17599', Fare=71.2833, Cabin='C85', Embarked='C'),
 Row(PassengerId=3, Survived=1, Pclass=3, Name='Heikkinen, Miss. Laina', Sex='female', Age=26.0, SibSp=0, Parch=0, Ticket='STON/O2. 3101282', Fare=7.925, Cabin=None, Embarked='S'),
 Row(PassengerId=4, Survived=1, Pclass=1, Name='Futrelle, Mrs. Jacques Heath (Lily May Peel)', Sex='female', Age=35.0, SibSp=1, Parch=0, Ticket='113803', Fare=53.1, Cabin='C123', Embarked='S'),
 Row(PassengerId=5, Survived=0, Pclass=3, Name='Allen, Mr. William Henry', Sex='male', Age=35.0, SibSp=0, Parch=0, Ticket='373450', Fare=8.05, Cabin=None, Embarked='S'),
 Row(PassengerId=6, Survived=0, Pclass=3, Name='Moran, Mr. James', Sex='male', Age=None, SibSp=0, Parch=0, Ticket='330877', Fare=8.4583, Cabin=None, Embarked='Q'),
 Row(PassengerId=7, Survived=0, Pclass=1, Name='McCarthy, Mr. Timothy J', Sex='male', Age=54.0, SibSp=0, Parch=0, Ticket='17463', Fare=51.8625, Cabin='E46', Embarked='S'),
 Row(PassengerId=8, Survived=0, Pclass=3, Name='Palsson, Master. Gosta Leonard', Sex='male', Age=2.0, SibSp=3, Parch=1, Ticket='349909', Fare=21.075, Cabin=None, Embarked='S'),
 Row(PassengerId=9, Survived=1, Pclass=3, Name='Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)', Sex='female', Age=27.0, SibSp=0, Parch=2, Ticket='347742', Fare=11.1333, Cabin=None, Embarked='S'),
 Row(PassengerId=10, Survived=1, Pclass=2, Name='Nasser, Mrs. Nicholas (Adele Achem)', Sex='female', Age=14.0, SibSp=1, Parch=0, Ticket='237736', Fare=30.0708, Cabin=None, Embarked='C')]

In [8]:
titanic_sdf

DataFrame[PassengerId: int, Survived: int, Pclass: int, Name: string, Sex: string, Age: double, SibSp: int, Parch: int, Ticket: string, Fare: double, Cabin: string, Embarked: string]

In [9]:
print(type(titanic_sdf.limit(10)))
titanic_sdf.limit(10).show()

<class 'pyspark.sql.dataframe.DataFrame'>
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|PassengerId|Survived|Pclass|                Name|   Sex| Age|SibSp|Parch|          Ticket|   Fare|Cabin|Embarked|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+
|          1|       0|     3|Braund, Mr. Owen ...|  male|22.0|    1|    0|       A/5 21171|   7.25| null|       S|
|          2|       1|     1|Cumings, Mrs. Joh...|female|38.0|    1|    0|        PC 17599|71.2833|  C85|       C|
|          3|       1|     3|Heikkinen, Miss. ...|female|26.0|    0|    0|STON/O2. 3101282|  7.925| null|       S|
|          4|       1|     1|Futrelle, Mrs. Ja...|female|35.0|    1|    0|          113803|   53.1| C123|       S|
|          5|       0|     3|Allen, Mr. Willia...|  male|35.0|    0|    0|          373450|   8.05| null|       S|
|          6|       0|     3|    Moran, Mr. James|  male|null|    0|    0|          330877| 8.4583| null|       Q|
|          7|       0|     1|McCarthy, Mr. Tim...|  male|54.0|    0|    0|           17463|51.8625|  E46|       S|
|          8|       0|     3|Palsson, Master. ...|  male| 2.0|    3|    1|          349909| 21.075| null|       S|
|          9|       1|     3|Johnson, Mrs. Osc...|female|27.0|    0|    2|          347742|11.1333| null|       S|
|         10|       1|     2|Nasser, Mrs. Nich...|female|14.0|    1|    0|          237736|30.0708| null|       C|
+-----------+--------+------+--------------------+------+----+-----+-----+----------------+-------+-----+--------+

In [10]:
titanic_pdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int32
 1   Survived     891 non-null    int32
 2   Pclass       891 non-null    int32
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int32
 7   Parch        891 non-null    int32
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int32(5), object(5)
memory usage: 66.3+ KB

In [11]:
titanic_sdf.printSchema()

root
 |-- PassengerId: integer (nullable = true)
 |-- Survived: integer (nullable = true)
 |-- Pclass: integer (nullable = true)
 |-- Name: string (nullable = true)
 |-- Sex: string (nullable = true)
 |-- Age: double (nullable = true)
 |-- SibSp: integer (nullable = true)
 |-- Parch: integer (nullable = true)
 |-- Ticket: string (nullable = true)
 |-- Fare: double (nullable = true)
 |-- Cabin: string (nullable = true)
 |-- Embarked: string (nullable = true)

In [12]:
from pyspark.sql.functions import count, isnan, when, col

titanic_sdf.select([count(when(isnan(column) | col(column).isNull(), column)) for column in titanic_sdf.columns])

DataFrame[count(CASE WHEN (isnan(PassengerId) OR (PassengerId IS NULL)) THEN PassengerId END): bigint, count(CASE WHEN (isnan(Survived) OR (Survived IS NULL)) THEN Survived END): bigint, count(CASE WHEN (isnan(Pclass) OR (Pclass IS NULL)) THEN Pclass END): bigint, count(CASE WHEN (isnan(Name) OR (Name IS NULL)) THEN Name END): bigint, count(CASE WHEN (isnan(Sex) OR (Sex IS NULL)) THEN Sex END): bigint, count(CASE WHEN (isnan(Age) OR (Age IS NULL)) THEN Age END): bigint, count(CASE WHEN (isnan(SibSp) OR (SibSp IS NULL)) THEN SibSp END): bigint, count(CASE WHEN (isnan(Parch) OR (Parch IS NULL)) THEN Parch END): bigint, count(CASE WHEN (isnan(Ticket) OR (Ticket IS NULL)) THEN Ticket END): bigint, count(CASE WHEN (isnan(Fare) OR (Fare IS NULL)) THEN Fare END): bigint, count(CASE WHEN (isnan(Cabin) OR (Cabin IS NULL)) THEN Cabin END): bigint, count(CASE WHEN (isnan(Embarked) OR (Embarked IS NULL)) THEN Embarked END): bigint]

In [13]:
titanic_sdf.select([count(when(isnan(column) | col(column).isNull(), column)).alias(column) for column in titanic_sdf.columns]).show()

+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|PassengerId|Survived|Pclass|Name|Sex|Age|SibSp|Parch|Ticket|Fare|Cabin|Embarked|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+
|          0|       0|     0|   0|  0|177|    0|    0|     0|   0|  687|       2|
+-----------+--------+------+----+---+---+-----+-----+------+----+-----+--------+

In [14]:
titanic_pdf.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [15]:
titanic_sdf.describe().show()

23/05/31 09:56:15 WARN package: Truncated the string representation of a plan since it was too large. This behavior can be adjusted by setting 'spark.sql.debug.maxToStringFields'.

+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|summary|      PassengerId|           Survived|            Pclass|                Name|   Sex|               Age|             SibSp|              Parch|            Ticket|             Fare|Cabin|Embarked|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+
|  count|              891|                891|               891|                 891|   891|               714|               891|                891|               891|              891|  204|     889|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642|                null|  null| 29.69911764705882|0.5230078563411896|0.38159371492704824|260318.54916792738| 32.2042079685746| null|    null|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|                null|  null|14.526497332334035|1.1027434322934315| 0.8060572211299488|471609.26868834975|49.69342859718089| null|    null|
|    min|                1|                  0|                 1|"Andersson, Mr. A...|female|              0.42|                 0|                  0|            110152|              0.0|  A10|       C|
|    max|              891|                  1|                 3|van Melkebeke, Mr...|  male|              80.0|                 8|                  6|         WE/P 5735|         512.3292|    T|       S|
+-------+-----------------+-------------------+------------------+--------------------+------+------------------+------------------+-------------------+------------------+-----------------+-----+--------+

In [16]:
titanic_sdf.dtypes

[('PassengerId', 'int'),
 ('Survived', 'int'),
 ('Pclass', 'int'),
 ('Name', 'string'),
 ('Sex', 'string'),
 ('Age', 'double'),
 ('SibSp', 'int'),
 ('Parch', 'int'),
 ('Ticket', 'string'),
 ('Fare', 'double'),
 ('Cabin', 'string'),
 ('Embarked', 'string')]

In [17]:
number_columns = [column_name for column_name, dtype in titanic_sdf.dtypes if dtype != 'string']
number_columns

['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

In [18]:
titanic_sdf.select(number_columns).describe().show()

+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|summary|      PassengerId|           Survived|            Pclass|               Age|             SibSp|              Parch|             Fare|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+
|  count|              891|                891|               891|               714|               891|                891|              891|
|   mean|            446.0| 0.3838383838383838| 2.308641975308642| 29.69911764705882|0.5230078563411896|0.38159371492704824| 32.2042079685746|
| stddev|257.3538420152301|0.48659245426485753|0.8360712409770491|14.526497332334035|1.1027434322934315| 0.8060572211299488|49.69342859718089|
|    min|                1|                  0|                 1|              0.42|                 0|                  0|              0.0|
|    max|              891|                  1|                 3|              80.0|                 8|                  6|         512.3292|
+-------+-----------------+-------------------+------------------+------------------+------------------+-------------------+-----------------+

In [19]:
titanic_pdf.shape

(891, 12)

In [20]:
len(titanic_sdf.columns), titanic_sdf.columns

(12,
 ['PassengerId',
  'Survived',
  'Pclass',
  'Name',
  'Sex',
  'Age',
  'SibSp',
  'Parch',
  'Ticket',
  'Fare',
  'Cabin',
  'Embarked'])

In [21]:
print(titanic_sdf.count())
print(type(titanic_sdf.count()))

891
<class 'int'>

In [22]:
titanic_sdf.count(), len(titanic_sdf.columns)

(891, 12)

In [23]:
dict_01 = {
    'Name': ['Sunggon', 'Changmin', 'Joonsoo', 'Jigyo', 'Hyeonjoon'],
    'Year': [2011, 2016, 2015, 2015, 2011],
    'Gender': ['Male', 'Male', 'Male', 'Female', 'Male']
}

data_pdf = pd.DataFrame(dict_01)
data_pdf

        Name  Year  Gender
0    Sunggon  2011    Male
1   Changmin  2016    Male
2    Joonsoo  2015    Male
3      Jigyo  2015  Female
4  Hyeonjoon  2011    Male

In [24]:
data_sdf = spark.createDataFrame(data_pdf)
type(data_sdf), data_sdf.show()

+---------+----+------+
|     Name|Year|Gender|
+---------+----+------+
|  Sunggon|2011|  Male|
| Changmin|2016|  Male|
|  Joonsoo|2015|  Male|
|    Jigyo|2015|Female|
|Hyeonjoon|2011|  Male|
+---------+----+------+

(pyspark.sql.dataframe.DataFrame, None)

In [25]:
data_pdf['Name']

0      Sunggon
1     Changmin
2      Joonsoo
3        Jigyo
4    Hyeonjoon
Name: Name, dtype: object

In [26]:
data_pdf[['Name', 'Year']]

        Name  Year
0    Sunggon  2011
1   Changmin  2016
2    Joonsoo  2015
3      Jigyo  2015
4  Hyeonjoon  2011

In [27]:
data_sdf.select('Name').show()

+---------+
|     Name|
+---------+
|  Sunggon|
| Changmin|
|  Joonsoo|
|    Jigyo|
|Hyeonjoon|
+---------+

In [28]:
# data_sdf.select(['Name', 'Year']).show()
data_sdf.select('Name', 'Year').show()

+---------+----+
|     Name|Year|
+---------+----+
|  Sunggon|2011|
| Changmin|2016|
|  Joonsoo|2015|
|    Jigyo|2015|
|Hyeonjoon|2011|
+---------+----+

In [29]:
data_sdf.select('*').show()

+---------+----+------+
|     Name|Year|Gender|
+---------+----+------+
|  Sunggon|2011|  Male|
| Changmin|2016|  Male|
|  Joonsoo|2015|  Male|
|    Jigyo|2015|Female|
|Hyeonjoon|2011|  Male|
+---------+----+------+

In [30]:
select_columns = data_sdf.columns
select_columns

# data_sdf.select(*select_columns).show()
data_sdf.select(select_columns).show()

+---------+----+------+
|     Name|Year|Gender|
+---------+----+------+
|  Sunggon|2011|  Male|
| Changmin|2016|  Male|
|  Joonsoo|2015|  Male|
|    Jigyo|2015|Female|
|Hyeonjoon|2011|  Male|
+---------+----+------+

In [31]:
select_columns.remove('Name')
data_sdf.select(*select_columns).show()

+----+------+
|Year|Gender|
+----+------+
|2011|  Male|
|2016|  Male|
|2015|  Male|
|2015|Female|
|2011|  Male|
+----+------+

In [32]:
data_sdf.select(data_sdf.Name, data_sdf.Year).show()

+---------+----+
|     Name|Year|
+---------+----+
|  Sunggon|2011|
| Changmin|2016|
|  Joonsoo|2015|
|    Jigyo|2015|
|Hyeonjoon|2011|
+---------+----+

In [33]:
data_sdf.select([data_sdf.Name, data_sdf.Year]).show()

+---------+----+
|     Name|Year|
+---------+----+
|  Sunggon|2011|
| Changmin|2016|
|  Joonsoo|2015|
|    Jigyo|2015|
|Hyeonjoon|2011|
+---------+----+

In [34]:
data_sdf.select(data_sdf['Name'], data_sdf['Year']).show()

+---------+----+
|     Name|Year|
+---------+----+
|  Sunggon|2011|
| Changmin|2016|
|  Joonsoo|2015|
|    Jigyo|2015|
|Hyeonjoon|2011|
+---------+----+

In [35]:
data_sdf.Name, data_sdf['Name']

(Column<'Name'>, Column<'Name'>)

In [36]:
data_pdf.Name

0      Sunggon
1     Changmin
2      Joonsoo
3        Jigyo
4    Hyeonjoon
Name: Name, dtype: object

In [37]:
from pyspark.sql.functions import col

data_sdf.select(col('Name'), col('Year')).show()

+---------+----+
|     Name|Year|
+---------+----+
|  Sunggon|2011|
| Changmin|2016|
|  Joonsoo|2015|
|    Jigyo|2015|
|Hyeonjoon|2011|
+---------+----+

In [38]:
type(data_sdf.Name), type(data_sdf['Name']), type(col('Name'))

(pyspark.sql.column.Column,
 pyspark.sql.column.Column,
 pyspark.sql.column.Column)

In [39]:
from pyspark.sql.functions import upper, col

data_sdf.select('*', upper(col('Name'))).show()

+---------+----+------+-----------+
|     Name|Year|Gender|upper(Name)|
+---------+----+------+-----------+
|  Sunggon|2011|  Male|    SUNGGON|
| Changmin|2016|  Male|   CHANGMIN|
|  Joonsoo|2015|  Male|    JOONSOO|
|    Jigyo|2015|Female|      JIGYO|
|Hyeonjoon|2011|  Male|  HYEONJOON|
+---------+----+------+-----------+

In [40]:
data_sdf.select(upper(col('Name')).alias('Cap_Name')).show()

+---------+
| Cap_Name|
+---------+
|  SUNGGON|
| CHANGMIN|
|  JOONSOO|
|    JIGYO|
|HYEONJOON|
+---------+

In [43]:
dict_01 = {
    'Name': ['Sunggon', 'Changmin', 'Joonsoo', 'Jigyo', 'Hyeonjoon'],
    'Year': [2011, 2016, 2015, 2015, 2011],
    'Gender': ['Male', 'Male', 'Male', 'Female', 'Male']
}
data_pdf = pd.DataFrame(dict_01)
data_sdf = spark.createDataFrame(data_pdf)
data_sdf.show()

+---------+----+------+
|     Name|Year|Gender|
+---------+----+------+
|  Sunggon|2011|  Male|
| Changmin|2016|  Male|
|  Joonsoo|2015|  Male|
|    Jigyo|2015|Female|
|Hyeonjoon|2011|  Male|
+---------+----+------+

In [45]:
data_sdf.filter(data_sdf.Name == 'Sunggon').show()

+-------+----+------+
|   Name|Year|Gender|
+-------+----+------+
|Sunggon|2011|  Male|
+-------+----+------+

In [46]:
# Error
data_sdf.filter('Name' == 'Sunggon').show()

PySparkTypeError: [NOT_COLUMN_OR_STR] Argument `condition` should be a Column or str, got bool.

In [47]:
data_sdf.where(col('Name') == 'Sunggon').show()

+-------+----+------+
|   Name|Year|Gender|
+-------+----+------+
|Sunggon|2011|  Male|
+-------+----+------+

In [48]:
data_sdf.filter('Name == "Sunggon"').show()

+-------+----+------+
|   Name|Year|Gender|
+-------+----+------+
|Sunggon|2011|  Male|
+-------+----+------+

In [51]:
data_sdf.filter((data_sdf['Gender'] == 'Male') & (data_sdf['Year'] > 2011)).show()

+--------+----+------+
|    Name|Year|Gender|
+--------+----+------+
|Changmin|2016|  Male|
| Joonsoo|2015|  Male|
+--------+----+------+

In [54]:
data_sdf.filter((data_sdf['Gender'] == 'Male') | (data_sdf['Year'] < 2011)).show()

+---------+----+------+
|     Name|Year|Gender|
+---------+----+------+
|  Sunggon|2011|  Male|
| Changmin|2016|  Male|
|  Joonsoo|2015|  Male|
|Hyeonjoon|2011|  Male|
+---------+----+------+

In [55]:
data_sdf.filter(col('Name').like('Sung%')).show()

+-------+----+------+
|   Name|Year|Gender|
+-------+----+------+
|Sunggon|2011|  Male|
+-------+----+------+

In [56]:
data_sdf.filter(col('Name').like('S%')).show()

+-------+----+------+
|   Name|Year|Gender|
+-------+----+------+
|Sunggon|2011|  Male|
+-------+----+------+

In [57]:
data_sdf.filter(col('Name').like('%u%')).show()

+-------+----+------+
|   Name|Year|Gender|
+-------+----+------+
|Sunggon|2011|  Male|
+-------+----+------+

In [58]:
data_sdf.filter('upper(Name) like "%G%"').show()

+--------+----+------+
|    Name|Year|Gender|
+--------+----+------+
| Sunggon|2011|  Male|
|Changmin|2016|  Male|
|   Jigyo|2015|Female|
+--------+----+------+

In [59]:
from pyspark.sql.functions import upper

data_sdf.filter(upper(col('Name')).like('%G%')).show()

+--------+----+------+
|    Name|Year|Gender|
+--------+----+------+
| Sunggon|2011|  Male|
|Changmin|2016|  Male|
|   Jigyo|2015|Female|
+--------+----+------+

In [61]:
data_sdf.filter(upper(data_sdf['Name']).like('%G%')).select('Year', 'Gender').show()

+----+------+
|Year|Gender|
+----+------+
|2011|  Male|
|2016|  Male|
|2015|Female|
+----+------+